[
  {
    "name": "Artificer",
    "url": "https://dnd5e.wikidot.com/artificer",
    "description": "Masters of invention, artificers use ingenuity and magic to unlock extraordinary capabilities in objects. They see magic as a complex system waiting to be decoded and then harnessed in their spells and inventions. You can find everything you need to play one of these inventors in the next few sections.",
    "subclasses": [
      {
        "name": "Alchemist",
        "url": "https://dnd5e.wikidot.com/artificer:alchemist",
        "description": "An Alchemist is an expert at combining reagents to produce mystical effects. Alchemists use their creations to give life and to leech it away. Alchemy is the oldest of artificer traditions, and its versatility has long been valued during times of war and peace."
      },
      {
        "name": "Armorer",
        "url": "https://dnd5e.wikidot.com/artificer:armorer",
        "description": "An artificer who specializes as an Armorer modifies armor to function almost like a second skin. The armor is enhanced to hone the artificer's magic, unleash potent attacks, and generate a formidable defense. The artificer bonds with this armor, becoming one with it even as they experiment with it and refine its magical capabilities."
      },
      {
        "name": "Artillerist",
        "url": "https://dnd5e.wikidot.com/artificer:artillerist",
        "description": "An Artillerist specializes in using magic to hurl energy, projectiles, and explosions on a battlefield. This destructive power is valued by armies in the wars on many different worlds. And when war passes, some members of this specialization seek to build a more peaceful world by using their powers to fight the resurgence of strife. The world-hopping gnome artificer Vi has been especially vocal about making things right: \"It's about time we fixed things instead of blowing them all to hell.\""
      },
      {
        "name": "Battle Smith",
        "url": "https://dnd5e.wikidot.com/artificer:battle-smith",
        "description": "Armies require protection, and someone has to put things back together if defenses fail. A combination of protector and medic, a Battle Smith is an expert at defending others and repairing both materiel and personnel. To aid in their work, Battle Smiths are accompanied by a steel defender, a protective companion of their own creation. Many soldiers tell stories of nearly dying before being saved by a Battle Smith and a steel defender."
      }
    ]
  },
  {
    "name": "Barbarian",
    "url": "https://dnd5e.wikidot.com/barbarian",
    "description": "For some, their rage springs from a communion with fierce animal spirits. Others draw from a roiling reservoir of anger at a world full of pain. For every barbarian, rage is a power that fuels not just a battle frenzy but also uncanny reflexes, resilience, and feats of strength.",
    "subclasses": [
      {
        "name": "Path of the Ancestral Guardian",
        "url": "https://dnd5e.wikidot.com/barbarian:ancestral-guardian",
        "description": "Some barbarians hail from cultures that revere their ancestors. These tribes teach that the warriors of the past linger in the world as mighty spirits, who can guide and protect the living. When a barbarian who follows this path rages, the barbarian contacts the spirit world and calls on these guardian spirits for aid."
      },
      {
        "name": "Path of the Battlerager",
        "url": "https://dnd5e.wikidot.com/barbarian:battlerager",
        "description": "Known as Kuldjargh (literally \"axe idiot\") in Dwarvish, battleragers are dwarf followers of the gods of war and take the Path of the Battlerager. They specialize in wearing bulky, spiked armor and throwing themselves into combat, striking with their body itself and giving themselves over to the fury of battle."
      },
      {
        "name": "Path of the Beast",
        "url": "https://dnd5e.wikidot.com/barbarian:beast",
        "description": "Barbarians who walk the Path of the Beast draw their rage from a bestial spark burning within their souls. That beast bursts forth in the throes of rage, physically transforming the barbarian."
      },
      {
        "name": "Path of the Berserker",
        "url": "https://dnd5e.wikidot.com/barbarian:berserker",
        "description": "For some barbarians, rage is a means to an end – that end being violence. The Path of the Berserker is a path of untrammeled fury, slick with blood. As you enter the berserker's rage, you thrill in the chaos of battle, heedless of your own health or well-being."
      },
      {
        "name": "Path of the Giant",
        "url": "https://dnd5e.wikidot.com/barbarian:giant",
        "description": "Barbarians who walk the Path of the Giant draw strength from the same primal forces as giants. As they rage, these barbarians surge with elemental power and grow in size, taking on forms that evoke the glory of giants. Some barbarians look like oversized versions of themselves, perhaps with a hint of elemental energy flaring in their eyes and around their weapons. Others transform more dramatically, taking on the appearance of an actual giant or a form similar to an Elemental, wreathed in fire, frost, or lightning."
      },
      {
        "name": "Path of the Storm Herald",
        "url": "https://dnd5e.wikidot.com/barbarian:storm-herald",
        "description": "Typical barbarians harbor a fury that dwells within. Their rage grants them superior strength, durability, and speed. Barbarians who follow the Path of the Storm Herald learn instead to transform their rage into a mantle of primal magic that swirls around them. When in a fury, a barbarian of this path taps into nature to create powerful, magical effects."
      },
      {
        "name": "Path of the Totem Warrior",
        "url": "https://dnd5e.wikidot.com/barbarian:totem-warrior",
        "description": "The Path of the Totem Warrior is a spiritual journey, as the barbarian accepts a spirit animal as guide, protector, and inspiration. In battle, your totem spirit fills you with supernatural might, adding magical fuel to your barbarian rage."
      },
      {
        "name": "Path of Wild Magic",
        "url": "https://dnd5e.wikidot.com/barbarian:wild-magic",
        "description": "Many places in the multiverse abound with beauty, intense emotion, and rampant magic; the Feywild, the Upper Planes, and other realms of supernatural power radiate with such forces and can profoundly influence people. As folk of deep feeling, barbarians are especially susceptible to these wild influences, with some barbarians being transformed by the magic. These magic-suffused barbarians walk the Path of Wild Magic. Elf, tiefling, aasimar, and genasi barbarians often seek this path, eager to manifest the otherworldly magic of their ancestors."
      },
      {
        "name": "Path of the Zealot",
        "url": "https://dnd5e.wikidot.com/barbarian:zealot",
        "description": "Some deities inspire their followers to pitch themselves into a ferocious battle fury. These barbarians are zealots – warriors who channel their rage into powerful displays of divine power."
      }
    ]
  },
  {
    "name": "Bard",
    "url": "https://dnd5e.wikidot.com/bard",
    "description": "Whether scholar, skald, or scoundrel, a bard weaves magic through words and music to inspire allies, demoralize foes, manipulate minds, create illusions, and even heal wounds. The bard is a master of song, speech, and the magic they contain.",
    "subclasses": [
      {
        "name": "Creation",
        "url": "https://dnd5e.wikidot.com/bard:creation",
        "description": "Bards believe the cosmos is a work of art - the creation of the first dragons and gods. That creative work included harmonies that continue to resound through existence today, a power known as the Song of Creation. The bards of the College of Creation draw on that primeval song through dance, music, and poetry, and their teachers share this lesson: \"Before the sun and the moon, there was the Song, and its music awoke the first dawn. Its melodies so delighted the stones and trees that some of them gained a voice of their own. And now they sing too. Learn the Song, students, and you too can teach the mountains to sing and dance.\""
      },
      {
        "name": "Eloquence",
        "url": "https://dnd5e.wikidot.com/bard:eloquence",
        "description": "Adherents of the College of Eloquence master the art of oratory. Persuasion is regarded as a high art, and a well-reasoned, well-spoken argument often proves more powerful than objective truth. These bards wield a blend of logic and theatrical wordplay, winning over skeptics and detractors with logical arguments, and plucking at heartstrings to appeal to the emotions of entire audiences."
      },
      {
        "name": "Glamour",
        "url": "https://dnd5e.wikidot.com/bard:glamour",
        "description": "The College of Glamour is the home of bards who mastered their craft in the vibrant realm of the Feywild or under the tutelage of someone who dwelled there. Tutored by satyrs, eladrin, and other fey, these bards learn to use their magic to delight and captivate others."
      },
      {
        "name": "Lore",
        "url": "https://dnd5e.wikidot.com/bard:lore",
        "description": "Bards of the College of Lore know something about most things, collecting bits of knowledge from sources as diverse as scholarly tomes and peasant tales. Whether singing folk ballads in taverns or elaborate compositions in royal courts, these bards use their gifts to hold audiences spellbound. When the applause dies down, the audience members might find themselves questioning everything they held to be true, from their faith in the priesthood of the local temple to their loyalty to the king."
      },
      {
        "name": "Spirits",
        "url": "https://dnd5e.wikidot.com/bard:spirits",
        "description": "Bards of the College of Spirits seek tales with inherent power-be they legends, histories, or fictions-and bring their subjects to life. Using occult trappings, these bards conjure spiritual embodiments of powerful forces to change the world once more. Such spirits are capricious, though, and what a bard summons isn't always entirely under their control."
      },
      {
        "name": "Swords",
        "url": "https://dnd5e.wikidot.com/bard:swords",
        "description": "Bards of the College of Swords are called blades, and they entertain through daring feats of weapon prowess. Blades perform stunts such as sword swallowing, knife throwing and juggling, and mock combats. Though they use their weapons to entertain, they are also highly trained and skilled warriors in their own right."
      },
      {
        "name": "Valor",
        "url": "https://dnd5e.wikidot.com/bard:valor",
        "description": "Bards of the College of Valor are daring skalds whose tales keep alive the memory of the great heroes of the past, and thereby inspire a new generation of heroes. These bards gather in mead halls or around great bonfires to sing the deeds of the mighty, both past and present. They travel the land to witness great events firsthand and to ensure that the memory of those events doesn't pass from the world. With their songs, they inspire others to reach the same heights of accomplishment as the heroes of old."
      },
      {
        "name": "Whispers",
        "url": "https://dnd5e.wikidot.com/bard:whispers",
        "description": "Most folk are happy to welcome a bard into their midst. Bards of the College of Whispers use this to their advantage. They appear to be like any other bard, sharing news, singing songs, and telling tales to the audiences they gather. In truth, the College of Whispers teaches its students that they are wolves among sheep. These bards use their knowledge and magic to uncover secrets and turn them against others through extortion and threats."
      },
      {
        "name": "Mage of Lorehold",
        "url": "https://dnd5e.wikidot.com/bard:mage-of-lorehold-ua",
        "description": "Mages of Lorehold are particularly concerned with the forces that underlie and drive history. Drawing inspiration from the scholars and adventurers of old, they manifest the arcane power of the past through ethereal dioramas and fantastical battle prowess. Lorehold mages are often found with a long-dead spirit summoned at their side—for who better to learn ancient history from than one who has experienced it first-hand?"
      },
      {
        "name": "Mage of Silverquill",
        "url": "https://dnd5e.wikidot.com/bard:mage-of-silverquill-ua",
        "description": "Mages of Silverquill hone the power of words. They channel the magic of light and shadow through words, whether spoken aloud, written, or signed through gestures. The words of a mage of Silverquill bring salvation to their allies and despair to their enemies."
      },
      {
        "name": "Creation",
        "url": "https://dnd5e.wikidot.com/bard:creation-ua",
        "description": "Bards believe the multiverse was given existence through word and sound, esoteric harmonies that continue to resound through existence: the Song of Creation. The bards of this college draw on this ancient power through performances of dance, music, or song to bring into being what they need most."
      },
      {
        "name": "Spirits",
        "url": "https://dnd5e.wikidot.com/bard:spirits-ua",
        "description": "Stories of the past are powerful; they hold lessons of history, philosophy, and magic. Bards of the College of Spirits seek the stories of those from beyond the material plane. Using gaming sets, they reach out to hear their stories, but the bards have no control over what story they find."
      },
      {
        "name": "Satire",
        "url": "https://dnd5e.wikidot.com/bard:satire-ua",
        "description": "Bards of the College of Satire are called jesters. They use lowbrow stories, daring acrobatics, and cutting jokes to entertain audiences, ranging from the crowds in a rundown dockside pub to the nobles of a king’s royal court. Where other bards seek forgotten lore or tales of epic bravery, jesters ferret out embarrassing and hilarious stories of all kinds. Whether telling the ribald tale of a brawny stable hand’s affair with an aged duchess or a mocking satire of a paladin of Helm’s cloying innocence, a jester never lets taste, social decorum, or shame get in the way of a good laugh."
      }
    ]
  },
  {
    "name": "Cleric",
    "url": "https://dnd5e.wikidot.com/cleric",
    "description": "Clerics are intermediaries between the mortal world and the distant planes of the gods. As varied as the gods they serve, clerics strive to embody the handiwork of their deities. No ordinary priest, a cleric is imbued with divine magic.",
    "subclasses": [
      {
        "name": "Arcana Domain",
        "url": "https://dnd5e.wikidot.com/cleric:arcana",
        "description": "Magic is an energy that suffuses the multiverse and that fuels both destruction and creation. Gods of the Arcana domain know the secrets and potential of magic intimately. For some of these gods, magical knowledge is a great responsibility that comes with a special understanding of the nature of reality. Other gods of Arcana see magic as pure power, to be used as its wielder sees fit."
      },
      {
        "name": "Death Domain",
        "url": "https://dnd5e.wikidot.com/cleric:death",
        "description": "The Death domain is concerned with the forces that cause death, as well as the negative energy that gives rise to undead creatures. Deities such as Chemosh, Myrkul, and Wee Jas are patrons of necromancers, death knights, liches, mummy lords, and vampires. Gods of the Death domain also embody murder (Anubis, Bhaal, and Pyremius), pain (Iuz or Loviatar), disease or poison (Incabulos, Talona, or Morgion), and the underworld (Hades and Hel)."
      },
      {
        "name": "Forge Domain",
        "url": "https://dnd5e.wikidot.com/cleric:forge",
        "description": "The gods of the forge are patrons of artisans who work with metal, from a humble blacksmith who keeps a village in horseshoes and plow blades to the mighty elf artisan whose diamond-tipped arrows of mithral have felled demon lords. The gods of the forge teach that, with patience and hard work, even the most intractable metal can be transformed from a lump of ore to a beautifully wrought object. Clerics of these deities search for objects lost to the forces of darkness, liberate mines overrun by orcs, and uncover rare and wondrous materials necessary to create potent magic items. Followers of these gods take great pride in their work, and they are willing to craft and use heavy armor and powerful weapons to protect them. Deities of this domain include Gond, Reorx, Onatar, Moradin, Hephaestus, and Goibhniu."
      },
      {
        "name": "Grave Domain",
        "url": "https://dnd5e.wikidot.com/cleric:grave",
        "description": "Gods of the grave watch over the line between life and death. To these deities, death and the afterlife are a foundational part of the multiverse’s workings. To resist death, or to desecrate the dead’s rest, is an abomination. Deities of the grave include Kelemvor, Wee Jas, the ancestral spirits of the Undying Court, Hades, Anubis, and Osiris. These deities teach their followers to respect the dead and pay them due homage. Followers of these deities seek to put restless spirits to rest, destroy the undead wherever they find them, and ease the suffering of dying creatures. Their magic also allows them to stave off a creature’s death, though they refuse to use such magic to extend a creature’s lifespan beyond its mortal limits."
      },
      {
        "name": "Knowledge Domain",
        "url": "https://dnd5e.wikidot.com/cleric:knowledge",
        "description": "The gods of knowledge – including Oghma, Boccob, Gilean, Aureon, and Thoth – value learning and understanding above all. Some teach that knowledge is to be gathered and shared in libraries and universities, or promote the practical knowledge of craft and invention. Some deities hoard knowledge and keep its secrets to themselves. And some promise their followers that they will gain tremendous power if they unlock the secrets of the multiverse. Followers of these gods study esoteric lore, collect old tomes, delve into the secret places of the earth, and learn all they can. Some gods of knowledge promote the practical knowledge of craft and invention, including smith deities like Gond, Reorx, Onatar, Moradin, Hephaestus, and Goibhniu."
      },
      {
        "name": "Life Domain",
        "url": "https://dnd5e.wikidot.com/cleric:life",
        "description": "The Life domain focuses on the vibrant positive energy – one of the fundamental forces of the universe – that sustains all life. The gods of life promote vitality and health through healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost any non-evil deity can claim influence over this domain, particularly agricultural deities (such as Chauntea, Arawai, and Demeter), sun gods (such as Lathander, Pelor, and Re-Horakhty), gods of healing or endurance (such as Ilmater, Mishakal, Apollo, and Diancecht), and gods of home and community (such as Hestia, Hathor, and Boldrci)."
      },
      {
        "name": "Light Domain",
        "url": "https://dnd5e.wikidot.com/cleric:light",
        "description": "Gods of light – including Helm, Lathander, Pholtus, Branchala, the Silver Flame, Belenus, Apollo, and Re-Horakhty – promote the ideals of rebirth and renewal, truth, vigilance, and beauty, often using the symbol of the sun. Some of these gods are portrayed as the sun itself or as a charioteer who guides the sun across the sky. Others are tireless sentinels whose eyes pierce every shadow and see through every deception. Some are deities of beauty and artistry, who teach that art is a vehicle for the soul's improvement. Clerics of a god of light are enlightened souls infused with radiance and the power of their gods' discerning vision, charged with chasing away lies and burning away darkness."
      },
      {
        "name": "Nature Domain",
        "url": "https://dnd5e.wikidot.com/cleric:nature",
        "description": "Gods of nature are as varied as the natural world itself; from inscrutable gods of the deep forests (such as Silvanus, Obad-Hai, Chislev, Balinor, and Pan) to friendly deities associated with particular springs and groves (such as Eldath). Druids revere nature as a whole and might serve one of these deities, practicing mysterious rites and reciting all-but-forgotten prayers in their own secret tongue. But many of these gods have clerics as well, champions who take a more active role in advancing the interests of a particular nature god. These clerics might hunt the evil monstrosities that despoil the woodlands, bless the harvest of the faithful, or wither the crops of those who anger their gods."
      },
      {
        "name": "Order Domain",
        "url": "https://dnd5e.wikidot.com/cleric:order",
        "description": "The Order Domain represents discipline, as well as devotion to the laws that govern a society, an institution, or a philosophy. Clerics of Order meditate on logic and justice as they serve their gods, examples of which appear in the Order Deities table."
      },
      {
        "name": "Peace Domain",
        "url": "https://dnd5e.wikidot.com/cleric:peace",
        "description": "The balm of peace thrives at the heart of healthy communities, between friendly nations, and in the souls of the kindhearted. The gods of peace inspire people of all sorts to resolve conflict and to stand up against those forces that try to prevent peace from flourishing. See the Peace Deities table for a list of some of the gods associated with this domain."
      },
      {
        "name": "Tempest Domain",
        "url": "https://dnd5e.wikidot.com/cleric:tempest",
        "description": "Gods whose portfolios include the Tempest domain – including Talos, Umberlee, Kord, Zeboim, the Devourer, Zeus, and Thor – govern storms, sea, and, sky. They include gods of lightning and thunder, gods of earthquakes, some fire gods, and certain gods of violence, physical strength, and courage. In some pantheons, a god of this domain rules over other deities and is known for swift justice delivered by thunderbolts. In the pantheons of seafaring people, gods of this domain are ocean deities and the patrons of sailors. Tempest gods send their clerics to inspire fear in the common folk, either to keep those folk on the path of righteousness or to encourage them to offer sacrifices of propitiation to ward off divine wrath."
      },
      {
        "name": "Trickery Domain",
        "url": "https://dnd5e.wikidot.com/cleric:trickery",
        "description": "Gods of trickery – such as Tymora, Beshaba, Olidammara, the Traveler, Garl Glittergold, and Loki – are mischief-makers and instigators who stand as a constant challenge to the accepted order among both gods and mortals. They're patrons of thieves, scoundrels, gamblers, rebels, and liberators. Their clerics are a disruptive force in the world, puncturing pride, mocking tyrants, stealing from the rich, freeing captives, and flouting hollow traditions. They prefer subterfuge, pranks, deception, and theft rather than direct confrontation."
      },
      {
        "name": "Twilight Domain",
        "url": "https://dnd5e.wikidot.com/cleric:twilight",
        "description": "The twilit transition from light into darkness often brings calm and even joy, as the day's labors end and the hours of rest begin. The darkness can also bring terrors, but the gods of twilight guard against the horrors of the night."
      },
      {
        "name": "War Domain",
        "url": "https://dnd5e.wikidot.com/cleric:war",
        "description": "War has many manifestations. It can make heroes of ordinary people. It can be desperate and horrific, with acts of cruelty and cowardice eclipsing instances of excellence and courage. In either case, the gods of war watch over warriors and reward them for their great deeds. The clerics of such gods excel in battle, inspiring others to fight the good fight or offering acts of violence as prayers. Gods of war include champions of honor and chivalry (such as Torm, Heironeous, and Kiri-Jolith) as well as gods of destruction and pillage (such as Erythnul, the Fury, Gruumsh, and Ares) and gods of conquest and domination (such as Bane, Hextor, and Maglubiyet). Other war gods (such as Tempus, Nike, and Nuada) take a more neutral stance, promoting war in all its manifestations and supporting warriors in any circumstance."
      },
      {
        "name": "Ambition Domain",
        "url": "https://dnd5e.wikidot.com/cleric:ambition",
        "description": "Clerics of Ambition act as cunning viziers who subtly plant the seeds that flower into the ambition their gods desire. Through insinuation, they remind acolytes, initiates, and veterans alike that achieving one’s place (in life or the afterlife) at the expense of others is not shameful, but is proof of determination and drive. Nothing is more important than that drive, they suggest – not the bonds of a family, not friendship or love. Not even devotion to a deity.."
      },
      {
        "name": "Solidarity Domain",
        "url": "https://dnd5e.wikidot.com/cleric:solidarity",
        "description": "Solidarity is the first virtue of Amonkhet's society. Oketra is charged with expounding upon this teaching of the God-Pharaoh, instilling in every initiate the virtue of solidarity. She forges each group of children into a crop of acolytes with just one purpose: to be judged worthy of a glorious afterlife. And she instills in each crop the ability to unite in a single action in pursuit of that purpose. She is fond of poetic imagery to communicate her ideals."
      },
      {
        "name": "Strength Domain",
        "url": "https://dnd5e.wikidot.com/cleric:strength",
        "description": "Strength is the third virtue of Amonkhet's society. It falls to Rhonas to instill this teaching in those who would enter the afterlife—but to his mind, the words themselves don’t matter. Strength can’t be taught. It must be built through practice and training. Rhonas demonstrates his teachings by his example, rather than by giving his students any kind of academic instruction. He welcomes the people of Naktamun to stand by the Hekma and watch him as he storms into the desert to battle the greatest horrors. He encourages them to observe his indomitable strength, for though they will never equal it, they can aspire to mimicry. He invites them to scrutinize every move and practice what they see."
      },
      {
        "name": "Zeal Domain",
        "url": "https://dnd5e.wikidot.com/cleric:zeal",
        "description": "Zeal is the fifth and final virtue of Amonkhet's society. The God-Pharaoh expects those he welcomes into the afterlife to desire it above all other pleasures and achievements, and for them to show their dedication, passion, and fervor through their actions. Hazoret is charged with cultivating this zeal in the initiates who come under her care, and she has undertaken the task with appropriate enthusiasm. She recognizes, however, that the best way to teach zeal is by demonstrating it."
      },
      {
        "name": "Fate Domain",
        "url": "https://dnd5e.wikidot.com/cleric:fate",
        "description": "The page cleric:fate you want to access does not exist."
      }
    ]
  },
  {
    "name": "Druid",
    "url": "https://dnd5e.wikidot.com/druid",
    "description": "Whether calling on the elemental forces of nature or emulating the creatures of the animal world, druids are an embodiment of nature's resilience, cunning, and fury. They claim no mastery over nature, but see themselves as extensions of nature's indomitable will.",
    "subclasses": [
      {
        "name": "Dreams",
        "url": "https://dnd5e.wikidot.com/druid:dreams",
        "description": "Druids who are members of the Circle of Dreams hail from regions that have strong ties to the Feywild and its dreamlike realms. The druids’ guardianship of the natural world makes for a natural alliance between them and good-aligned fey. These druids seek to fill the world with dreamy wonder. Their magic mends wounds and brings joy to downcast hearts, and the realms they protect are gleaming, fruitful places, where dream and reality blur together and where the weary can find rest."
      },
      {
        "name": "Land",
        "url": "https://dnd5e.wikidot.com/druid:land",
        "description": "The Circle of the Land is made up of mystics and sages who safeguard ancient knowledge and rites through a vast oral tradition. These druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle's wisest members preside as the chief priests of communities that hold to the Old Faith and serve as advisors to the rulers of those folk. As a member of this circle, your magic is influenced by the land where you were initiated into the circle's mysterious rites."
      },
      {
        "name": "Moon",
        "url": "https://dnd5e.wikidot.com/druid:moon",
        "description": "Druids of the Circle of the Moon are fierce guardians of the wilds. Their order gathers under the full moon to share news and trade warnings. They haunt the deepest parts of the wilderness, where they might go for weeks on end before crossing paths with another humanoid creature, let alone another druid."
      },
      {
        "name": "Shepherd",
        "url": "https://dnd5e.wikidot.com/druid:shepherd",
        "description": "Druids of the Circle of the Shepherd commune with the spirits of nature, especially the spirits of beasts and the fey, and call to those spirits for aid. These druids recognize that all living things play a role in the natural world, yet they focus on protecting animals and fey creatures that have difficulty defending themselves. Shepherds, as they are known, see such creatures as their charges. They ward off monsters that threaten them, rebuke hunters who kill more prey than necessary, and prevent civilization from encroaching on rare animal habitats and on sites sacred to the fey."
      },
      {
        "name": "Spores",
        "url": "https://dnd5e.wikidot.com/druid:spores",
        "description": "Druids of the Circle of Spores find beauty in decay. They see within mold and other fungi the ability to transform lifeless material into abundant, albeit somewhat strange, life. These druids believe that life and death are parts of a grand cycle, with one leading to the other and then back again. Death isn't the end of life, but instead a change of state that sees life shift into a new form."
      },
      {
        "name": "Stars",
        "url": "https://dnd5e.wikidot.com/druid:stars",
        "description": "The Circle of Stars allows druids to draw on the power of starlight. These druids have tracked heavenly patterns since time immemorial, discovering secrets hidden amid the constellations. By revealing and understanding these secrets, the Circle of the Stars seeks to harness the powers of the cosmos."
      },
      {
        "name": "Wildfire",
        "url": "https://dnd5e.wikidot.com/druid:wildfire",
        "description": "Druids within the Circle of Wildfire understand that destruction is sometimes the precursor of creation, such as when a forest fire promotes later growth. These druids bond with a primal spirit that harbors both destructive and creative power, allowing the druids to create controlled flames that burn away one thing but give life to another."
      },
      {
        "name": "Stars",
        "url": "https://dnd5e.wikidot.com/druid:stars-ua",
        "description": "An ancient lineage, the Circle of Stars allows druids to draw on the power of starlight. These druids have tracked heavenly patterns since time immemorial, discovering secrets hidden amid the constellations. By revealing and understanding these secrets, the Circle of the Stars seeks to harness the powers of the cosmos."
      },
      {
        "name": "Twilight",
        "url": "https://dnd5e.wikidot.com/druid:twilight-ua",
        "description": "The Circle of Twilight seeks to exterminate undead creatures and preserve the natural cycle of life and death that rules over the cosmos. Their magic allows them to manipulate the boundary between life and death, sending their foes to their final rest while keeping their allies from that fate."
      },
      {
        "name": "Wildfire",
        "url": "https://dnd5e.wikidot.com/druid:wildlife-ua",
        "description": "Druids who are members of the Circle of Wildfire understand the necessity of destruction, such as how a forest fire promotes growth. These druids bond with a primal spirit that harbors destructive tendencies, allowing the druids to use their power to create controlled flames that help flora and fauna reproduce and grow."
      }
    ]
  },
  {
    "name": "Fighter",
    "url": "https://dnd5e.wikidot.com/fighter",
    "description": "Fighters share an unparalleled mastery with weapons and armor, and a thorough knowledge of the skills of combat. They are well acquainted with death, both meting it out and staring it defiantly in the face.",
    "subclasses": [
      {
        "name": "Arcane Archer",
        "url": "https://dnd5e.wikidot.com/fighter:arcane-archer",
        "description": "An Arcane Archer studies a unique elven method of archery that weaves magic into attacks to produce supernatural effects. Arcane Archers are some of their most elite warriors among the elves. They stand watch over the fringes of elven domains, keeping a keen eye out for trespassers and using magic-infused arrows to defeat monsters and invaders before they can reach elven settlements. Over the centuries, the methods of these elf archers have been learned by members of other races who can also balance arcane aptitude with archery."
      },
      {
        "name": "Banneret",
        "url": "https://dnd5e.wikidot.com/fighter:banneret",
        "description": "A banneret is a knight who inspires greatness in others by committing brave deeds in battle. The mere presence of one in a hamlet is enough to cause some orcs and bandits to seek easier prey. A lone banneret is a skilled warrior, but a banneret leading a band of allies can transform even the most poorly equipped militia into a ferocious war band."
      },
      {
        "name": "Battle Master",
        "url": "https://dnd5e.wikidot.com/fighter:battle-master",
        "description": "Those who emulate the archetypal Battle Master employ martial techniques passed down through generations. To a Battle Master, combat is an academic field, sometimes including subjects beyond battle such as weaponsmithing and calligraphy. Not every fighter absorbs the lessons of history, theory, and artistry that are reflected in the Battle Master archetype, but those who do are well-rounded fighters of great skill and knowledge."
      },
      {
        "name": "Cavalier",
        "url": "https://dnd5e.wikidot.com/fighter:cavalier",
        "description": "The archetypal cavalier excels at mounted combat. Usually born among the nobility and raised at court, a cavalier is equally at home leading a cavalry charge or exchanging repartee at a state dinner. Cavaliers also learn how to guard those in their charge from harm, often serving as the protectors of their superiors and of the weak. Compelled to right wrongs or earn prestige, many of these fighters leave their lives of comfort to embark on glorious adventure."
      },
      {
        "name": "Champion",
        "url": "https://dnd5e.wikidot.com/fighter:champion",
        "description": "The archetypal Champion focuses on the development of raw physical power honed to deadly perfection. Those who model themselves on this archetype combine rigorous training with physical excellence to deal devastating blows."
      },
      {
        "name": "Echo Knight",
        "url": "https://dnd5e.wikidot.com/fighter:echo-knight",
        "description": "A mysterious and feared frontline warrior of the Kryn Dynasty, the Echo Knight has mastered the art of using dunamis to summon the fading shades of unrealized timelines to aid them in battle. Surrounded by echoes of their own might, they charge into the fray as a cycling swarm of shadows and strikes."
      },
      {
        "name": "Eldritch Knight",
        "url": "https://dnd5e.wikidot.com/fighter:eldritch-knight",
        "description": "The archetypal Eldritch Knight combines the martial mastery common to all fighters with a careful study of magic. Eldritch Knights use magical techniques similar to those practiced by wizards. They focus their study on two of the eight schools of magic: abjuration and evocation. Abjuration spells grant an Eldritch Knight additional protection in battle, and evocation spells deal damage to many foes at once, extending the fighter's reach in combat. These knights learn a comparatively small number of spells, committing them to memory instead of keeping them in a spellbook."
      },
      {
        "name": "Psi Warrior",
        "url": "https://dnd5e.wikidot.com/fighter:psi-warrior",
        "description": "Awake to the psionic power within, a Psi Warrior is a fighter who augments their physical might with psi-infused weapon strikes, telekinetic lashes, and barriers of mental force. Many githyanki train to become such warriors, as do some of the most disciplined high elves. In the world of Eberron, many young kalashtar dream of becoming Psi Warriors."
      },
      {
        "name": "Rune Knight",
        "url": "https://dnd5e.wikidot.com/fighter:rune-knight",
        "description": "Rune Knights enhance their martial prowess using the supernatural power of runes, an ancient practice that originated with giants. Rune cutters can be found among any family of giants, and you likely learned your methods first or second hand from such a mystical artisan. Whether you found the giant's work carved into a hill or cave, learned of the runes from a sage, or met the giant in person, you studied the giant's craft and learned how to apply magic runes to empower your equipment."
      },
      {
        "name": "Samurai",
        "url": "https://dnd5e.wikidot.com/fighter:samurai",
        "description": "The Samurai is a fighter who draws on an implacable fighting spirit to overcome enemies. A samurai’s resolve is nearly unbreakable, and the enemies in a samurai’s path have two choices: yield or die fighting."
      }
    ]
  },
  {
    "name": "Monk",
    "url": "https://dnd5e.wikidot.com/monk",
    "description": "Monks are united in their ability to magically harness the energy that flows in their bodies. Whether channeled as a striking display of combat prowess or a subtler focus of defensive ability and speed, this energy infuses all that a monk does.",
    "subclasses": [
      {
        "name": "Way of Mercy",
        "url": "https://dnd5e.wikidot.com/monk:mercy",
        "description": "Monks of the Way of Mercy learn to manipulate the life force of others to bring aid to those in need. They are wandering physicians to the poor and hurt. However, to those beyond their help, they bring a swift end as an act of mercy."
      },
      {
        "name": "Way of the Ascendant Dragon",
        "url": "https://dnd5e.wikidot.com/monk:ascendant-dragon",
        "description": "The fundamental teaching of this tradition holds that by emulating dragons, a monk becomes a more integrated part of the world and its magic. By altering their spirit to resonate with draconic might, monks who follow this tradition augment their prowess in battle, bolster their allies, and can even soar through the air on draconic wings. But all this power is in service of a greater goal: achieving a spiritual unity with the essence of the Material Plane."
      },
      {
        "name": "Way of the Astral Self",
        "url": "https://dnd5e.wikidot.com/monk:astral-self",
        "description": "A monk who follows the Way of the Astral Self believes their body is an illusion. They see their ki as a representation of their true form, an astral self. This astral self has the capacity to be a force of order or disorder, with some monasteries training students to use their power to protect the weak and other instructing aspirants in how to manifest their true selves in service to the mighty."
      },
      {
        "name": "Way of the Drunken Master",
        "url": "https://dnd5e.wikidot.com/monk:drunken-master",
        "description": "The Way of the Drunken Master teaches its students to move with the jerky, unpredictable movements of a drunkard. A drunken master sways, tottering on unsteady feet, to present what seems like an incompetent combatant who proves frustrating to engage. The drunken master’s erratic stumbles conceal a carefully executed dance of blocks, parries, advances, attacks, and retreats."
      },
      {
        "name": "Way of the Four Elements",
        "url": "https://dnd5e.wikidot.com/monk:four-elements",
        "description": "You follow a monastic tradition that teaches you to harness the elements. When you focus your ki, you can align yourself with the forces of creation and bend the four elements to your will, using them as an extension of your body. Some members of this tradition dedicate themselves to a single element, but others weave the elements together."
      },
      {
        "name": "Way of the Kensei",
        "url": "https://dnd5e.wikidot.com/monk:kensei",
        "description": "Monks of the Way of the Kensei train relentlessly with their weapons, to the point that the weapon becomes like an extension of the body. Founded on a mastery of sword fighting, the tradition has expanded to include many different weapons."
      },
      {
        "name": "Way of the Long Death",
        "url": "https://dnd5e.wikidot.com/monk:long-death",
        "description": "Monks of the Way of the Long Death are obsessed with the meaning and mechanics of dying. They capture creatures and prepare elaborate experiments to capture, record, and understand the moments of their demise. They then use this knowledge to guide their understanding of martial arts, yielding a deadly fighting style."
      },
      {
        "name": "Way of the Open Hand",
        "url": "https://dnd5e.wikidot.com/monk:open-hand",
        "description": "Monks of the Way of the Open Hand are the ultimate masters of martial arts combat, whether armed or unarmed. They learn techniques to push and trip their opponents, manipulate ki to heal damage to their bodies, and practice advanced meditation that can protect them from harm."
      },
      {
        "name": "Way of Shadow",
        "url": "https://dnd5e.wikidot.com/monk:shadow",
        "description": "Monks of the Way of Shadow follow a tradition that values stealth and subterfuge. These monks might be called ninjas or shadowdancers, and they serve as spies and assassins. Sometimes the members of a ninja monastery are family members, forming a clan sworn to secrecy about their arts and missions. Other monasteries are more like thieves' guilds, hiring out their services to nobles, rich merchants, or anyone else who can pay their fees. Regardless of their methods, the heads of these monasteries expect the unquestioning obedience of their students."
      },
      {
        "name": "Way of the Sun Soul",
        "url": "https://dnd5e.wikidot.com/monk:sun-soul",
        "description": "Monks of the Way of the Sun Soul learn to channel their own life energy into searing bolts of light. They teach that meditation can unlock the ability to unleash the indomitable light shed by the soul of every living creature."
      }
    ]
  },
  {
    "name": "Paladin",
    "url": "https://dnd5e.wikidot.com/paladin",
    "description": "Whether sworn before a god's altar and the witness of a priest, in a sacred glade before nature spirits and fey beings, or in a moment of desperation and grief with the dead as the only witness, a paladin's oath is a powerful bond.",
    "subclasses": [
      {
        "name": "Ancients",
        "url": "https://dnd5e.wikidot.com/paladin:ancients",
        "description": "The Oath of the Ancients is as old as the race of elves and the rituals of the druids. Sometimes called fey knights, green knights, or horned knights, paladins who swear this oath cast their lot with the side of the light in the cosmic struggle against darkness because they love the beautiful and life-giving things of the world, not necessarily because they believe in principles of honor, courage, and justice. They adorn their armor and clothing with images of growing things-leaves, antlers, or flowers-to reflect their commitment to preserving life and light in the world."
      },
      {
        "name": "Conquest",
        "url": "https://dnd5e.wikidot.com/paladin:conquest",
        "description": "The Oath of Conquest calls to paladins who seek glory in battle and the subjugation of their enemies. It isn’t enough for these paladins to establish order. They must crush the forces of chaos. Sometimes called knight tyrants or iron mongers, those who swear this oath gather into grim orders that serve gods or philosophies of war and well-ordered might."
      },
      {
        "name": "Crown",
        "url": "https://dnd5e.wikidot.com/paladin:crown",
        "description": "The Oath of the Crown is sworn to the ideals of civilization, be it the spirit of a nation, fealty to a sovereign, or service to a deity of law and rulership. The paladins who swear this oath dedicate themselves to serving society and, in particular, the just laws that hold society together. These paladins are the watchful guardians on the walls, standing against the chaotic tides of barbarism that threaten to tear down all that civilization has built, and are commonly known as guardians, exemplars, or sentinels. Often, paladins who swear this oath are members of an order of knighthood in service to a nation or a sovereign, and undergo their oath as part of their admission to the order's ranks."
      },
      {
        "name": "Devotion",
        "url": "https://dnd5e.wikidot.com/paladin:devotion",
        "description": "The Oath of Devotion binds a paladin to the loftiest ideals of justice, virtue, and order. Sometimes called cavaliers, white knights, or holy warriors, these paladins meet the ideal of the knight in shining armor, acting with honor in pursuit of justice and the greater good. They hold themselves to the highest standards of conduct, and some, for better or worse, hold the rest of the world to the same standards. Many who swear this oath are devoted to gods of law and good and use their gods' tenets as the measure of their devotion. They hold angels – the perfect servants of good – as their ideals, and incorporate images of angelic wings into their helmets or coats of arms."
      },
      {
        "name": "Glory",
        "url": "https://dnd5e.wikidot.com/paladin:glory",
        "description": "Paladins who take the Oath of Glory believe they and their companions are destined to achieve glory through deeds of heroism. They train diligently and encourage their companions so they're all ready when destiny calls."
      },
      {
        "name": "Redemption",
        "url": "https://dnd5e.wikidot.com/paladin:redemption",
        "description": "The Oath of Redemption sets a paladin on a difficult path, one that requires a holy warrior to use violence only as a last resort. Paladins who dedicate themselves to this oath believe that any person can be redeemed and that the path of benevolence and justice is one that anyone can walk. These paladins face evil creatures in the hope of turning them to the light, and the paladins slay them only when such a deed will clearly save other lives. Paladins who follow this path are known as redeemers."
      },
      {
        "name": "Vengeance",
        "url": "https://dnd5e.wikidot.com/paladin:vengeance",
        "description": "The Oath of Vengeance is a solemn commitment to punish those who have committed a grievous sin. When evil forces slaughter helpless villagers, when an entire people turns against the will of the gods, when a thieves' guild grows too violent and powerful, when a dragon rampages through the countryside – at times like these, paladins arise and swear an Oath of Vengeance to set right that which has gone wrong. To these paladins – sometimes called avengers or dark knights – their own purity is not as important as delivering justice."
      },
      {
        "name": "Watchers",
        "url": "https://dnd5e.wikidot.com/paladin:watchers",
        "description": "The Oath of the Watchers binds paladins to protect mortal realms from the predations of extraplanar creatures, many of which can lay waste to mortal soldiers. Thus, the Watchers hone their minds, spirits, and bodies to be the ultimate weapons against such threats."
      },
      {
        "name": "Oathbreaker",
        "url": "https://dnd5e.wikidot.com/paladin:oathbreaker",
        "description": "An oathbreaker is a paladin who breaks their sacred oaths to pursue some dark ambition or serve an evil power. Whatever light burned in the paladin's heart been extinguished. Only darkness remains."
      },
      {
        "name": "Treachery",
        "url": "https://dnd5e.wikidot.com/paladin:treachery-ua",
        "description": "The Oath of Treachery is the path followed by paladins who have forsworn other oaths or who care only for their own power and survival. Commonly known as blackguards, these profane warriors are faithful only to themselves. Anyone desperate enough to follow one of these paladins does so because, while deceitful, these paladins command great power. Those who follow them without falling prey to their treachery hope to indulge in wanton violence and accumulate great treasure."
      },
      {
        "name": "Redemption",
        "url": "https://dnd5e.wikidot.com/paladin:redemption-ua",
        "description": "The Oath of Redemption sets a paladin on a difficult path, one that requires a holy warrior to use violence only as a last resort. Paladins who dedicate themselves to this oath believe that any person can be redeemed and that the path of benevolence and justice is one that anyone can walk. These paladins face evil creatures in the hope of turning them to the light, and the paladins slay them only when such a deed will clearly save other lives. Paladins who follow this path are known as redeemers."
      },
      {
        "name": "Watchers",
        "url": "https://dnd5e.wikidot.com/paladin:watchers-ua",
        "description": "Paladins who vow the Oath of the Watchers seek to protect the moral realm from the predations of extraplanar creatures, many of which can lay waste to mortal soldiers. Thus, the Watchers hone their minds, spirits, and bodies to be the ultimate weapons against such threats."
      },
      {
        "name": "Heroism",
        "url": "https://dnd5e.wikidot.com/paladin:heroism-ua",
        "description": "The Oath of Heroism is an affirmation of a destined path, one laid out for you by divine hands. For whatever reason, a god or a group of gods has included you in their machinations. You are not a reluctant hero, but one who fully embraces the idea that great deeds are yours to achieve. You train diligently, sculpting your body and refining your skills so you're ready when destiny calls."
      }
    ]
  },
  {
    "name": "Ranger",
    "url": "https://dnd5e.wikidot.com/ranger",
    "description": "Far from the bustle of cities and towns, past the hedges that shelter the most distant farms from the terrors of the wild, amid the dense-packed trees of trackless forests and across wide and empty plains, rangers keep their unending watch.",
    "subclasses": [
      {
        "name": "Beast Master Conclave",
        "url": "https://dnd5e.wikidot.com/ranger:beast-master",
        "description": "The Beast Master archetype embodies a friendship between the civilized races and the beasts of the world. United in focus, beast and ranger work as one to fight the monstrous foes that threaten civilization and the wilderness alike. Emulating the Beast Master archetype means committing yourself to this ideal, working in partnership with an animal as its companion and friend."
      },
      {
        "name": "Fey Wanderer",
        "url": "https://dnd5e.wikidot.com/ranger:fey-wanderer",
        "description": "A fey mystique surrounds you, thanks to the boon of an archfey, the shining fruit you ate from a talking tree, the magic spring you swam in, or some other auspicious event. However you acquired your fey magic, you are now a Fey Wanderer, a ranger who represents both the mortal and the fey realms. As you wander the multiverse, your joyful laughter brightens the hearts of the downtrodden, and your martial prowess strikes terror in your foes, for great is the mirth of the fey and dreadful is their fury."
      },
      {
        "name": "Gloom Stalker Conclave",
        "url": "https://dnd5e.wikidot.com/ranger:gloom-stalker",
        "description": "Gloom stalkers are at home in the darkest places: deep under the earth, in gloomy alleyways, in primeval forests, and wherever else the light dims. Most folk enter such places with trepidation, but a gloom stalker ventures boldly into the darkness, seeking to ambush threats before they can reach the broader world. Such rangers are often found in the Underdark, but they will go any place where evil lurks in the shadows."
      },
      {
        "name": "Horizon Walker Conclave",
        "url": "https://dnd5e.wikidot.com/ranger:horizon-walker",
        "description": "Horizon walkers guard the world against threats that originate from other planes or that seek to ravage the mortal realm with otherworldly magic. They seek out planar portals and keep watch over them, venturing to the Inner Planes and the Outer Planes as needed to pursue their foes. These rangers are also friends to any forces in the multiverse – especially benevolent dragons, fey, and elementals – that work to preserve life and the order of the planes."
      },
      {
        "name": "Hunter Conclave",
        "url": "https://dnd5e.wikidot.com/ranger:hunter",
        "description": "Some rangers seek to master weapons to better protect civilization from the terrors of the wilderness. Members of the Hunter Conclave learn specialized fighting techniques for use against the most dire threats, from rampaging ogres and hordes of orcs to towering giants and terrifying dragons."
      },
      {
        "name": "Swarmkeeper",
        "url": "https://dnd5e.wikidot.com/ranger:swarmkeeper",
        "description": "Feeling a deep connection to the environment around them, some rangers reach out through their magical connection to the world and bond with a swarm of nature spirits. The swarm becomes a potent force in battle, as well as helpful company for the ranger. Some Swarmkeepers are outcasts or hermits, keeping to themselves and their attendant swarms rather than dealing with the discomfort of others. Other Swarmkeepers enjoy building vibrant communities that work for the mutual benefit of all those they consider part of their swarm."
      }
    ]
  },
  {
    "name": "Rogue",
    "url": "https://dnd5e.wikidot.com/rogue",
    "description": "Rogues rely on skill, stealth, and their foes' vulnerabilities to get the upper hand in any situation. They have a knack for finding the solution to just about any problem, demonstrating a resourcefulness and versatility that is the cornerstone of any successful adventuring party.",
    "subclasses": [
      {
        "name": "Arcane Trickster",
        "url": "https://dnd5e.wikidot.com/rogue:arcane-trickster",
        "description": "Some rogues enhance their fine-honed skills of stealth and agility with magic, learning tricks of enchantment and illusion. These rogues include pickpockets and burglars, but also pranksters, mischief-makers, and a significant number of adventurers."
      },
      {
        "name": "Assassin",
        "url": "https://dnd5e.wikidot.com/rogue:assassin",
        "description": "You focus your training on the grim art of death. Those who adhere to this archetype are diverse: hired killers, spies, bounty hunters, and even specially anointed priests trained to exterminate the enemies of their deity. Stealth, poison, and disguise help you eliminate your foes with deadly efficiency."
      },
      {
        "name": "Inquisitive",
        "url": "https://dnd5e.wikidot.com/rogue:inquisitive",
        "description": "As an archetypal Inquisitive, you excel at rooting out secrets and unraveling mysteries. You rely on your sharp eye for detail, but also on your finely honed ability to read the words and deeds of other creatures to determine their true intent. You excel at defeating creatures that hide among and prey upon ordinary folk, and your mastery of lore and your sharp eye make you well equipped to expose and end hidden evils."
      },
      {
        "name": "Mastermind",
        "url": "https://dnd5e.wikidot.com/rogue:mastermind",
        "description": "Your focus is on people and on the influence and secrets they have. Many spies, courtiers, and schemers follow this archetype, leading lives of intrigue. Words are your weapons as often as knives or poison, and secrets and favors are some of your favorite treasures."
      },
      {
        "name": "Phantom",
        "url": "https://dnd5e.wikidot.com/rogue:phantom",
        "description": "Many rogues walk a fine line between life and death, risking their own lives and taking the lives of others. While adventuring on that line, some rogues discover a mystical connection to death itself. These rogues take knowledge from the dead and become immersed in negative energy, eventually becoming like ghosts. Thieves' guilds value them as highly effective information gatherers and spies."
      },
      {
        "name": "Scout",
        "url": "https://dnd5e.wikidot.com/rogue:scout",
        "description": "You are skilled in stealth and surviving far from the streets of a city, allowing you to scout ahead of your companions during expeditions. Rogues who embrace this archetype are at home in the wilderness and among barbarians and rangers, and many Scouts serve as the eyes and ears of war bands. Ambusher, spy, bounty hunter – these are just a few of the roles that Scouts assume as they range the world."
      },
      {
        "name": "Soulknife",
        "url": "https://dnd5e.wikidot.com/rogue:soulknife",
        "description": "Most assassins strike with physical weapons, and many burglars and spies use thieves' tools to infiltrate secure locations. In contrast, a Soulknife strikes and infiltrates with the mind, cutting through barriers both physical and psychic. These rogues discover psionic power within themselves and channel it to do their roguish work. They find easy employment as members of thieves' guilds, though they are often mistrusted by rogues who are leery of anyone using strange mind powers to conduct their business. Most governments would also be happy to employ a Soulknife as a spy."
      },
      {
        "name": "Swashbuckler",
        "url": "https://dnd5e.wikidot.com/rogue:swashbuckler",
        "description": "You focus your training on the art of the blade, relying on speed, elegance, and charm in equal parts. While some warriors are brutes clad in heavy armor, your method of fighting looks almost like a performance. Duelists and pirates typically belong to this archetype."
      },
      {
        "name": "Thief",
        "url": "https://dnd5e.wikidot.com/rogue:thief",
        "description": "You hone your skills in the larcenous arts. Burglars, bandits, cutpurses, and other criminals typically follow this archetype, but so do rogues who prefer to think of themselves as professional treasure seekers, explorers, delvers, and investigators. In addition to improving your agility and stealth, you learn skills useful for delving into ancient ruins, reading unfamiliar languages, and using magic items you normally couldn't employ."
      }
    ]
  },
  {
    "name": "Sorcerer",
    "url": "https://dnd5e.wikidot.com/sorcerer",
    "description": "Sorcerers carry a magical birthright conferred upon them by an exotic bloodline, some otherworldly influence, or exposure to unknown cosmic forces. No one chooses sorcery; the power chooses the sorcerer.",
    "subclasses": [
      {
        "name": "Aberrant Mind",
        "url": "https://dnd5e.wikidot.com/sorcerer:aberrant-mind",
        "description": "An alien influence has wrapped its tendrils around your mind, giving you psionic power. You can now touch other minds with that power and alter the world around you by using it to control the magical energy of the multiverse. Will this power shine from you as a hopeful beacon to others? Or will you be a source of terror to those who feel the stab of your mind and witness the strange manifestations of your might?"
      },
      {
        "name": "Clockwork Soul",
        "url": "https://dnd5e.wikidot.com/sorcerer:clockwork-soul",
        "description": "The cosmic force of order has suffused you with magic. That power arises from Mechanus or a realm like it-a plane of existence shaped entirely by clockwork efficiency. You, or someone from your lineage, might have become entangled in the machinations of the modrons, the orderly beings who inhabit Mechanus. Perhaps your ancestor even took part in the Great Modron March. Whatever its origin within you, the power of order can seem strange to others, but for you, it is part of a vast and glorious system."
      },
      {
        "name": "Draconic Bloodline",
        "url": "https://dnd5e.wikidot.com/sorcerer:draconic-bloodline",
        "description": "Your innate magic comes from draconic magic that was mingled with your blood or that of your ancestors. Most often, sorcerers with this origin trace their descent back to a mighty sorcerer of ancient times who made a bargain with a dragon or who might even have claimed a dragon parent. Some of these bloodlines are well established in the world, but most are obscure. Any given sorcerer could be the first of a new bloodline, as a result of a pact or some other exceptional circumstance."
      },
      {
        "name": "Divine Soul",
        "url": "https://dnd5e.wikidot.com/sorcerer:divine-soul",
        "description": "Sometimes the spark of magic that fuels a sorcerer comes from a divine source that glimmers within the soul. Having such a blessed soul is a sign that your innate magic might come from a distant but powerful familial connection to a divine being. Perhaps your ancestor was an angel, transformed into a mortal and sent to fight in a god’s name. Or your birth might align with an ancient prophecy, marking you as a servant of the gods or a chosen vessel of divine magic."
      },
      {
        "name": "Lunar Sorcery",
        "url": "https://dnd5e.wikidot.com/sorcerer:lunar-sorcery",
        "description": "On many worlds, the moon is a revered celestial body with magical properties. On Krynn, the gods of magic are associated with the world's three moons. On the world of Toril, the god Selûne uses the light of the moon to battle darkness. On Eberron, scholars of the Draconic Prophecy decipher ancient secrets from the waxing and waning of that world's twelve moons."
      },
      {
        "name": "Shadow Magic",
        "url": "https://dnd5e.wikidot.com/sorcerer:shadow-magic",
        "description": "You are a creature of shadow, for your innate magic comes from the Shadowfell itself. You might trace your lineage to an entity from that place, or perhaps you were exposed to its fell energy and transformed by it."
      },
      {
        "name": "Storm Sorcery",
        "url": "https://dnd5e.wikidot.com/sorcerer:storm-sorcery",
        "description": "Your innate magic comes from the power of elemental air. Many with this power can trace their magic back to a near-death experience caused by the Great Rain, but perhaps you were born during a howling gale so powerful that folk still tell stories of it, or your lineage might include the influence of potent air creatures such as vaati or djinn. Whatever the case, the magic of the storm permeates your being."
      },
      {
        "name": "Wild Magic",
        "url": "https://dnd5e.wikidot.com/sorcerer:wild-magic",
        "description": "Your innate magic comes from the wild forces of chaos that underlie the order of creation. You might have endured exposure to some form of raw magic, perhaps through a planar portal leading to Limbo, the Elemental Planes, or the mysterious Far Realm. Perhaps you were blessed by a powerful fey creature or marked by a demon. Or your magic could be a fluke of your birth, with no apparent cause or reason. However it came to be, this chaotic magic churns within you, waiting for any outlet."
      },
      {
        "name": "Pyromancy",
        "url": "https://dnd5e.wikidot.com/sorcerer:pyromancy",
        "description": "Your innate magic manifests in fire. You are your fire, and your fire is you."
      },
      {
        "name": "Lunar Magic",
        "url": "https://dnd5e.wikidot.com/sorcerer:lunar-magic-ua",
        "description": "On many worlds, the moon is a revered celestial body with magical properties. On Krynn, the gods of magic are associated with the world's three moons. On the world of Toril, the god Selûne uses the light of the moon to battle darkness. On Eberron, scholars of the Draconic Prophecy decipher ancient secrets from the waxing and waning of that world's twelve moons."
      },
      {
        "name": "Aberrant Mind",
        "url": "https://dnd5e.wikidot.com/sorcerer:aberrant-mind-ua",
        "description": "An alien influence has wrapped its tendrils around you, warping you in both body and mind. Perhaps a psychic splinter lodged in your psyche after you suffered domination by an aboleth. Maybe you were born somewhere tainted by the Far Realm, a planar blot that changed you forever. Or perhaps mind flayers kidnapped you, subjecting you to the nightmarish process of ceremorphosis—but the transformation failed and left you altered."
      },
      {
        "name": "Clockwork Soul",
        "url": "https://dnd5e.wikidot.com/sorcerer:clockwork-soul-ua",
        "description": "A plane of utmost order, Mechanus is a realm overseen by a godlike entity called Primus, whose actions are inscrutable and calculations, vast. You, or someone from your lineage, might have become entangled in one of the machinations of the leader of the modrons. Perhaps you were exposed to an artifact created by Primus, or your ancestor took part in the Great Modron March in some way."
      },
      {
        "name": "Favored Soul (2015)",
        "url": "https://dnd5e.wikidot.com/sorcerer:favored-soul-ua",
        "description": "Source: Unearthed Arcana 3 - Modifying Classes"
      },
      {
        "name": "Favored Soul (2017)",
        "url": "https://dnd5e.wikidot.com/sorcerer:favored-soul-revisited-ua",
        "description": "Sometimes the spark of magic that fuels a sorcerer comes from a divine source that glimmers within the soul. Having such a favored soul, your innate magic might come from a distant but powerful familial connection to a divine being. Perhaps your ancestor was an angel, transformed into a mortal and sent to fight in a god’s name. Or your birth might align with an ancient prophecy, marking you as a servant of the gods or a chosen vessel of divine magic."
      },
      {
        "name": "Giant Soul",
        "url": "https://dnd5e.wikidot.com/sorcerer:giant-soul-ua",
        "description": "The giants once dwelled in a fabled realm known as Ostoria, a paradise for their folk that reflected their mastery of the mortal realm. In time, Ostoria fell, and the giants were scattered and broken. During that mythic era, the giants granted a few chosen individuals among the small folk a shard of their great power. These favored people were caught in the same tragedy that sundered Ostoria. Since that time, they have spread across the many worlds of the multiverse. Now and again, one of their descendants manifests the gifts imparted by the giants, granting them sorcerous magic that allows them to command the elements and gain the might of a giant."
      },
      {
        "name": "Phoenix Sorcery",
        "url": "https://dnd5e.wikidot.com/sorcerer:phoenix-sorcery-ua",
        "description": "Your power draws from the immortal flame that fuels the legendary phoenix. You or your ancestors perhaps rendered a phoenix a great service, or you were born in its presence. Whatever the cause, a shard of the phoenix’s power dwells within you."
      },
      {
        "name": "Psionic Soul",
        "url": "https://dnd5e.wikidot.com/sorcerer:psionic-soul-ua",
        "description": "One day a light blazed forth within you—the illumination of psionic power. Your mind now simmers with this power, the full extent of which you won’t fully grasp for years to come. You can touch other minds with it and alter the world around you by using it to control the magical energy of the multiverse. Will this power shine from you as a hopeful beacon to others? Or will you be a source of terror to those who feel the stab of your mind and witness the strange manifestations of your might?"
      },
      {
        "name": "Sea Sorcery",
        "url": "https://dnd5e.wikidot.com/sorcerer:sea-sorcery-ua",
        "description": "The power of water is the strength of flexibility, resilience, and a relentless nature. Water parts to allow a ship to sail over it or a diver to plunge into it, but their passing leaves no mark. Water flowing down a mountain reaches the sea. It might bend and turn across valleys and down hillsides, but it slowly and steadily returns to the waves. Those whose souls are touched by the power of elemental water command a similar power."
      },
      {
        "name": "Shadow",
        "url": "https://dnd5e.wikidot.com/sorcerer:shadow-ua",
        "description": "Your innate magic comes from the Shadowfell. You might trace your lineage to an entity from that place, or perhaps you were exposed to its fell energy and transformed in some fundamental manner."
      },
      {
        "name": "Stone Sorcery",
        "url": "https://dnd5e.wikidot.com/sorcerer:stone-sorcery-ua",
        "description": "Your magic springs from a mystical link between your soul and the magic of elemental earth. You might trace a distant ancestor to the Plane of Earth, or your family might have earned a mighty boon in return for a service to the dao lords. Whatever your past, the magic of elemental earth is yours to command."
      }
    ]
  },
  {
    "name": "Warlock",
    "url": "https://dnd5e.wikidot.com/warlock",
    "description": "Warlocks are seekers of the knowledge that lies hidden in the fabric of the multiverse. Through pacts made with mysterious beings of supernatural power, warlocks unlock magical effects both subtle and spectacular.",
    "subclasses": [
      {
        "name": "Archfey",
        "url": "https://dnd5e.wikidot.com/warlock:archfey",
        "description": "Your patron is a lord or lady of the fey, a creature of legend who holds secrets that were forgotten before the mortal races were born. This being's motivations are often inscrutable, and sometimes whimsical, and might involve a striving for greater magical power or the settling of age-old grudges. Beings of this sort include the Prince of Frost; the Queen of Air and Darkness, ruler of the Gloaming Court; Titania of the Summer Court; her consort Oberon, the Green Lord; Hyrsam, the Prince of Fools; and ancient hags."
      },
      {
        "name": "Celestial",
        "url": "https://dnd5e.wikidot.com/warlock:celestial",
        "description": "Your patron is a powerful being of the Upper Planes. You have bound yourself to an ancient empyrean, solar, ki-rin, unicorn, or other entity that resides in the planes of everlasting bliss. Your pact with that being allows you to experience the barest touch of the holy light that illuminates the multiverse."
      },
      {
        "name": "Fathomless",
        "url": "https://dnd5e.wikidot.com/warlock:fathomless",
        "description": "You have plunged into a pact with the deeps. An entity of the ocean, the Elemental Plane of Water, or another otherworldly sea now allows you to draw on its thalassic power. Is it merely using you to learn about terrestrial realms, or does it want you to open cosmic floodgates and drown the world?"
      },
      {
        "name": "Fiend",
        "url": "https://dnd5e.wikidot.com/warlock:fiend",
        "description": "You have made a pact with a fiend from the lower planes of existence, a being whose aims are evil, even if you strive against those aims. Such beings desire the corruption or destruction of all things, ultimately including you. Fiends powerful enough to forge a pact include demon lords such as Demogorgon, Orcus, Fraz'Urb-luu, and Baphomet; archdevils such as Asmodeus, Dispater, Mephistopheles, and Belial; pit fiends and balors that are especially mighty; and ultroloths and other lords of the yugoloths."
      },
      {
        "name": "Genie",
        "url": "https://dnd5e.wikidot.com/warlock:the-genie",
        "description": "You have made a pact with one of the rarest kinds of genie, a noble genie. Such entities rule vast fiefs on the Elemental Planes and have great influence over lesser genies and elemental creatures. Noble genies are varied in their motivations, but most are arrogant and wield power that rivals that of lesser deities. They delight in turning the table on mortals, who often bind genies into servitude, and readily enter into pacts that expand their reach."
      },
      {
        "name": "Great Old One",
        "url": "https://dnd5e.wikidot.com/warlock:great-old-one",
        "description": "Your patron is a mysterious entity whose nature is utterly foreign to the fabric of reality. It might come from the Far Realm, the space beyond reality, or it could be one of the elder gods known only in legends. Its motives are incomprehensible to mortals, and its knowledge so immense and ancient that even the greatest libraries pale in comparison to the vast secrets it holds. The Great Old One might be unaware of your existence or entirely indifferent to you, but the secrets you have learned allow you to draw your magic from it."
      },
      {
        "name": "Hexblade",
        "url": "https://dnd5e.wikidot.com/warlock:hexblade",
        "description": "You have made your pact with a mysterious entity from the Shadowfell – a force that manifests in sentient magic weapons carved from the stuff of shadow. The mighty sword Blackrazor is the most notable of these weapons, which have been spread across the multiverse over the ages. The shadowy force behind these weapons can offer power to warlocks who form pacts with it. Many hexblade warlocks create weapons that emulate those formed in the Shadowfell. Others forgo such arms, content to weave the dark magic of that plane into their spellcasting."
      },
      {
        "name": "Undead",
        "url": "https://dnd5e.wikidot.com/warlock:undead",
        "description": "You've made a pact with a deathless being, a creature that defies the cycle and life and death, forsaking its mortal shell so it might eternally pursue its unfathomable ambitions. For such beings, time and morality are fleeting things, the concerns of those for whom grains of sand still rush through life's hourglass. Having once been mortal themselves, these ancient undead know firsthand the paths of ambition and the routes past the doors of death. They eagerly share this profane knowledge, along with other secrets, with those who work their will among the living."
      },
      {
        "name": "Undying",
        "url": "https://dnd5e.wikidot.com/warlock:undying",
        "description": "Death holds no sway over your patron, who has unlocked the secrets of everlasting life, although such a prize – like all power – comes at a price. Once mortal, the Undying has seen mortal lifetimes pass like the seasons, like the flicker of endless days and nights. It has the secrets of the ages to share, secrets of life and death. Beings of this sort include Vecna, Lord of the Hand and the Eye; the dread Iuz; the lich-queen Vol; the Undying Court of Aerenal; Vlaakith, lich-queen of the githyanki; and the deathless wizard Fistandantalus."
      },
      {
        "name": "Celestial",
        "url": "https://dnd5e.wikidot.com/warlock:celestial-ua",
        "description": "Your patron is a powerful being of the Upper Planes. You have bound yourself to an ancient empyrean, solar, ki-rin, or unicorn or to another entity that resides in the planes of everlasting bliss. Your pact with that being allows you to experience the barest touch of the holy light that illuminates the multiverse."
      },
      {
        "name": "Genie",
        "url": "https://dnd5e.wikidot.com/warlock:genie-ua",
        "description": "You have made a pact with one of the rarest kinds of genie, a noble genie. Such entities are rulers of vast fiefs on the Elemental Planes and have great influence over lesser genies and elemental creatures. Noble genies are varied in their motivations but are all arrogant and wield power that rivals that of lesser deities. They delight in turning the table on mortals who so love to bind genies into servitude, readily entering into pacts that expand their reach across the multiverse."
      },
      {
        "name": "Ghost in the Machine",
        "url": "https://dnd5e.wikidot.com/warlock:ghost-in-the-machine-ua",
        "description": "You have made a bargain for power granted by an entity that you believe to be completely digital. Whether it is a rogue AI or the spirit of a deceased hacker, the Ghost in the Machine is capable of feats that defy explanation."
      },
      {
        "name": "Hexblade",
        "url": "https://dnd5e.wikidot.com/warlock:hexblade-ua",
        "description": "You have made your pact with a powerful, sentient magic weapon carved from the stuff of the Shadowfell. The mighty sword Blackrazor is the most notable of these weapons, several of which have spread across the multiverse over the ages. These weapons grow stronger as they consume the life essence of their victims. The strongest of them can use their ties to the Shadowfell to offer power to mortals who serve them. The Raven Queen forged the first of these weapons. They, along with the hexblade warlocks, are another tool she can use to manipulate events in the Material Plane to her inscrutable ends."
      },
      {
        "name": "Lurker in the Deep",
        "url": "https://dnd5e.wikidot.com/warlock:lurker-in-the-deep-ua",
        "description": "You made a pact with an entity that lurks somewhere deep in the ocean, or even on the Elemental Plane of Water, such as a mighty kraken, an ancient primordial, or a monstrous being from creation’s earliest days. You serve as this creature’s eyes and ears, watching the world beyond its domain and reporting your findings. You may have gained this pact as a member of a cult dedicated to the entity or after your patron saved your life when you nearly drowned at sea."
      },
      {
        "name": "Noble Genie",
        "url": "https://dnd5e.wikidot.com/warlock:noble-genie-ua",
        "description": "You made a pact with one of the rarest of geniekind, a noble genie. Such entities are rulers of vast fiefs on the Elemental Planes and have great influence over lesser genies and elemental creatures. Noble genies are varied in their motivations but are all arrogant collectors of creatures, knowledge, and treasure. A genie values their collection and will protect that which they claim ownership over. Through your connection to the noble, you can leverage their influence and extend their ownership of things in the multiverse."
      },
      {
        "name": "Raven Queen",
        "url": "https://dnd5e.wikidot.com/warlock:raven-queen-ua",
        "description": "Your patron is the Raven Queen, a mysterious being who rules the Shadowfell from a palace of ice deep within that dread realm. The Raven Queen watches over the world, anticipating each creature’s death and ensuring that it meets its end at the proscribed time and place. As the ruler of the Shadowfell, she dwells in a decayed, dark reflection of the world. Her ability to reach into the world is limited. Thus, she turns to mortal warlocks to serve her will. Warlocks sworn to the Raven Queen receive visions and whispers from her in their dreams, sending them on quests and warning them of impending dangers."
      },
      {
        "name": "Seeker",
        "url": "https://dnd5e.wikidot.com/warlock:seeker-ua",
        "description": "Your patron is an inscrutable being who travels the Astral Plane in search of knowledge and secrets. In return for your patron’s gifts, you wander the world seeking lore that you can share with the Seeker."
      },
      {
        "name": "Undead",
        "url": "https://dnd5e.wikidot.com/warlock:undead-ua",
        "description": "The Undead is an entity that resides in the dark corners of the multiverse. Your patron could be Acererak, Azalin, Lord Soth, Strahd, or some other ancient undead being. You may seek to gain knowledge from your patron’s countless lifetimes of experience, while it may see you as a piece of a centuries long plan."
      },
      {
        "name": "Undying Light",
        "url": "https://dnd5e.wikidot.com/warlock:undying-light-ua",
        "description": "Your patron is not a specific entity, but the energy that radiates from the Positive Plane. Your pact allows you to experience the barest touch of the raw stuff of life that powers the multiverse. Anything more, and you would be instantly incinerated by its energy."
      },
      {
        "name": "Eldritch Invocations",
        "url": "https://dnd5e.wikidot.com/warlock:eldritch-invocations",
        "description": "Source: Player's Handbook\nPrerequisite: eldritch blast cantrip"
      }
    ]
  },
  {
    "name": "Wizard",
    "url": "https://dnd5e.wikidot.com/wizard",
    "description": "Wizards are supreme magic-users, defined and united as a class by the spells they cast. Drawing on the subtle weave of magic that permeates the cosmos, wizards cast spells of explosive fire, arcing lightning, subtle deception, brute-force mind control, and much more.",
    "subclasses": [
      {
        "name": "Abjuration",
        "url": "https://dnd5e.wikidot.com/wizard:abjuration",
        "description": "The School of Abjuration emphasizes magic that blocks, banishes, or protects. Detractors of this school say that its tradition is about denial, negation rather than positive assertion. You understand, however, that ending harmful effects, protecting the weak, and banishing evil influences is anything but a philosophical void. It is a proud and respected vocation."
      },
      {
        "name": "Bladesinging",
        "url": "https://dnd5e.wikidot.com/wizard:bladesinging",
        "description": "Bladesingers master a tradition of wizardry that incorporates swordplay and dance. Originally created by elves, this tradition has been adopted by non-elf practitioners, who honor and expand on the elven ways."
      },
      {
        "name": "Chronurgy",
        "url": "https://dnd5e.wikidot.com/wizard:chronurgy",
        "description": "Focusing on the manipulation of time, those who follow the Chronurgy tradition learn to alter the pace of reality to their liking. Using the ramping of anticipatory dunamis energy, these mages can bend the flow of time as adroitly as a skilled musician plays an instrument, lending themselves and their allies an advantage in the blink of an eye."
      },
      {
        "name": "Conjuration",
        "url": "https://dnd5e.wikidot.com/wizard:conjuration",
        "description": "As a conjurer, you favor spells that produce objects and creatures out of thin air. You can conjure billowing clouds of killing fog or summon creatures from elsewhere to fight on your behalf. As your mastery grows, you learn spells of transportation and can teleport yourself across vast distances, even to other planes of existence, in an instant."
      },
      {
        "name": "Divination",
        "url": "https://dnd5e.wikidot.com/wizard:divination",
        "description": "The counsel of a diviner is sought by royalty and commoners alike, for all seek a clearer understanding of the past, present, and future. As a diviner, you strive to part the veils of space, time, and consciousness so that you can see clearly. You work to master spells of discernment, remote viewing, supernatural knowledge, and foresight."
      },
      {
        "name": "Enchantment",
        "url": "https://dnd5e.wikidot.com/wizard:enchantment",
        "description": "As a member of the School of Enchantment, you have honed your ability to magically entrance and beguile other people and monsters. Some enchanters are peacemakers who bewitch the violent to lay down their arms and charm the cruel into showing mercy. Others are tyrants who magically bind the unwilling into their service. Most enchanters fall somewhere in between."
      },
      {
        "name": "Evocation",
        "url": "https://dnd5e.wikidot.com/wizard:evocation",
        "description": "You focus your study on magic that creates powerful elemental effects such as bitter cold, searing flame, rolling thunder, crackling lightning, and burning acid. Some evokers find employment in military forces, serving as artillery to blast enemy armies from afar. Others use their spectacular power to protect the weak, while some seek their own gain as bandits, adventurers, or aspiring tyrants."
      },
      {
        "name": "Graviturgy",
        "url": "https://dnd5e.wikidot.com/wizard:graviturgy",
        "description": "Understanding and mastering the forces that draw bodies of matter together or drive them apart, the students of the Graviturgy arcane tradition learn to further bend and manipulate the violent energy of gravity to their benefit, and the terrible detriment of their enemies."
      },
      {
        "name": "Illusion",
        "url": "https://dnd5e.wikidot.com/wizard:illusion",
        "description": "You focus your studies on magic that dazzles the senses, befuddles the mind, and tricks even the wisest folk. Your magic is subtle, but the illusions crafted by your keen mind make the impossible seem real. Some illusionists – including many gnome wizards – are benign tricksters who use their spells to entertain. Others are more sinister masters of deception, using their illusions to frighten and fool others for their personal gain."
      },
      {
        "name": "Necromancy",
        "url": "https://dnd5e.wikidot.com/wizard:necromancy",
        "description": "The School of Necromancy explores the cosmic forces of life, death, and undeath. As you focus your studies in this tradition, you learn to manipulate the energy that animates all living things. As you progress, you learn to sap the life force from a creature as your magic destroys its body, transforming that vital energy into magical power you can manipulate."
      },
      {
        "name": "Order of Scribes",
        "url": "https://dnd5e.wikidot.com/wizard:order-of-scribes",
        "description": "Magic of the book-that's what many folk call wizardry. The name is apt, given how much time wizards spend poring over tomes and penning theories about the nature of magic. It's rare to see wizards traveling without books and scrolls sprouting from their bags, and a wizard would go to great lengths to plumb an archive of ancient knowledge."
      },
      {
        "name": "Transmutation",
        "url": "https://dnd5e.wikidot.com/wizard:transmutation",
        "description": "You are a student of spells that modify energy and matter. To you, the world is not a fixed thing, but eminently mutable, and you delight in being an agent of change. You wield the raw stuff of creation and learn to alter both physical forms and mental qualities. Your magic gives you the tools to become a smith on reality's forge."
      },
      {
        "name": "War Magic",
        "url": "https://dnd5e.wikidot.com/wizard:war-magic",
        "description": "A variety of arcane colleges specialize in training wizards for war. The tradition of War Magic blends principles of evocation and abjuration, rather than specializing in either of those schools. It teaches techniques that empower a caster’s spells, while also providing methods for wizards to bolster their own defenses."
      },
      {
        "name": "Runecrafter",
        "url": "https://dnd5e.wikidot.com/wizard:runecrafter-ua",
        "description": "Source: Unearthed Arcana 83 - Giant Options"
      },
      {
        "name": "Artificer",
        "url": "https://dnd5e.wikidot.com/wizard:artificer-ua",
        "description": "Source: Unearthed Arcana 1 - Eberron"
      },
      {
        "name": "Invention",
        "url": "https://dnd5e.wikidot.com/wizard:invention-ua",
        "description": "The School of Invention claims credit for inventing the other schools of magic – a claim other wizards find absurd. Wizards of this school push magic to its limits. They stretch the known laws of arcane power and strive to reveal important truths about the nature of the multiverse."
      },
      {
        "name": "Lore Mastery",
        "url": "https://dnd5e.wikidot.com/wizard:lore-mastery-ua",
        "description": "Lore Mastery is an arcane tradition fixated on understanding the underlying mechanics of magic. It is the most academic of all arcane traditions. The promise of uncovering new knowledge or proving (or discrediting) a theory of magic is usually required to rouse its practitioners from their laboratories, academies, and archives to pursue a life of adventure."
      },
      {
        "name": "Onomancy",
        "url": "https://dnd5e.wikidot.com/wizard:onomancy-ua",
        "description": "Practitioners of magic well know the power of names, but wizards who follow the tradition of Onomancy use their magic to manipulate the words that encompass existence. Onomancers expand their study into language itself, searching for threads of magical significance that weave through names. Something that is named stands out in the multiverse, distinct from the tapestry of creation all around it."
      },
      {
        "name": "Order of Scribes",
        "url": "https://dnd5e.wikidot.com/wizard:order-of-scribes-ua",
        "description": "Magic of the book—that’s what many spellcasters call wizardry. The name is apt, given how much time wizards spend poring over their spellbooks, penning theories about the nature of magic, and exploring the farthest recesses of libraries. It’s rare to see a wizard traveling without books and scrolls sprouting from their bags, and a wizard would go to great lengths to plumb an archive of ancient knowledge."
      },
      {
        "name": "Psionics",
        "url": "https://dnd5e.wikidot.com/wizard:psionics-ua",
        "description": "Wizards study magical power in all its forms, including the magic of psionics. Those wizards who follow the tradition of Psionics hone the magical potential of their own minds. Sometimes called psionicists or mentalists, these wizards interact with the multiverse through the lens of their psionic aptitude and awareness."
      },
      {
        "name": "Technomancy",
        "url": "https://dnd5e.wikidot.com/wizard:technomancy-ua",
        "description": "Unlike the more common arcane traditions based around the schools of magic, the tradition of Technomancy does not focus on a singular type of spellcraft or magical energy. Rather, students of Technomancy concern themselves with how their spells interact with modern technology."
      },
      {
        "name": "Theurgy",
        "url": "https://dnd5e.wikidot.com/wizard:theurgy-ua",
        "description": "A number of deities claim arcane magic as their domain, for magic is as much a part of the fabric of the cosmos as wind, fire, lightning, and all other primal forces. Just as there are deities of the sea and gods of warfare, the arcane arts feature their own divine patrons."
      }
    ]
  }
]