[
  {"name": "Dragonborn", "url": "https://dnd5e.wikidot.com/dragonborn", "description": "Born of dragons, as their name proclaims, the dragonborn walk proudly through a world that greets them with fearful incomprehension. Shaped by draconic gods or the dragons themselves, dragonborn originally hatched from dragon eggs as a unique race, combining the best attributes of dragons and humanoids."},
  {"name": "Dwarf", "url": "https://dnd5e.wikidot.com/dwarf", "description": "Kingdoms rich in ancient grandeur, halls carved into the roots of mountains, the echoing of picks and hammers in deep mines and blazing forges, a commitment to clan and tradition, and a burning hatred of goblins and orcs – these common threads unite all dwarves."},
  {"name": "Elf", "url": "https://dnd5e.wikidot.com/elf", "description": "Elves are a magical people of otherworldly grace, living in places of ethereal beauty, in the midst of ancient forests or in silvery spires glittering with faerie light, where soft music drifts through the air and gentle fragrances waft on the breeze. Elves love nature and magic, art and artistry, music and poetry."},
  {"name": "Gnome", "url": "https://dnd5e.wikidot.com/gnome", "description": "A constant hum of busy activity pervades the warrens and neighborhoods where gnomes form their close-knit communities. Gnomes take delight in life, enjoying every moment of invention, exploration, investigation, creation, and play."},
  {"name": "Half-Elf", "url": "https://dnd5e.wikidot.com/half-elf", "description": "Walking in two worlds but truly belonging to neither, half-elves combine what some say are the best qualities of their elf and human parents: human curiosity, inventiveness, and ambition tempered by the refined senses, love of nature, and artistic tastes of the elves."},
  {"name": "Half-Orc", "url": "https://dnd5e.wikidot.com/half-orc", "description": "When alliances between humans and orcs are sealed by marriages, half-orcs are born. Some half-orcs rise to become proud chiefs of orc tribes, their human blood giving them an edge over their full-blooded orc rivals."},
  {"name": "Halfling", "url": "https://dnd5e.wikidot.com/halfling", "description": "The comforts of home are the goals of most halflings' lives: a place to settle in peace and quiet, far from marauding monsters and clashing armies. Others form nomadic bands that travel constantly, lured by the open road and the wide horizon to discover the wonders of new lands and peoples."},
  {"name": "Human", "url": "https://dnd5e.wikidot.com/human", "description": "In the reckonings of most worlds, humans are the youngest of the common races, late to arrive on the world scene and short-lived in comparison to dwarves, elves, and dragons. Perhaps it is because of their shorter lives that they strive to achieve as much as they can in the years they are given."},
  {"name": "Tiefling", "url": "https://dnd5e.wikidot.com/tiefling", "description": "To be greeted with stares and whispers, to suffer violence and insult on the street, to see mistrust and fear in every eye: this is the lot of the tiefling. And to twist the knife, tieflings know that this is because a pact struck generations ago infused the essence of Asmodeus, overlord of the Nine Hells, into their bloodline."},
  {"name": "Aarakocra", "url": "https://dnd5e.wikidot.com/lineage:aarakocra", "description": "A winged people who originated on the Elemental Plane of Air, aarakocra soar through the sky wherever they wander. From below, aarakocra look like large birds and thus are sometimes called birdfolk. Only when they roost or walk is their humanoid nature clear."},
  {"name": "Aasimar", "url": "https://dnd5e.wikidot.com/lineage:aasimar", "description": "Whether descended from a celestial being or infused with heavenly power, aasimar are mortals who carry a spark of the Upper Planes within their souls. They can fan that spark to bring light, ease wounds, and unleash the fury of the heavens."},
  {"name": "Changeling", "url": "https://dnd5e.wikidot.com/lineage:changeling", "description": "With ever-changing appearances, changelings reside in many societies undetected. Each changeling can supernaturally adopt any face they like, using their shape-shifting ability for mischief, malice, or to right wrongs."},
  {"name": "Deep Gnome", "url": "https://dnd5e.wikidot.com/lineage:deep-gnome", "description": "Deep gnomes, or svirfneblin, are natives of the Underdark and are suffused with that subterranean realm’s magic. They can supernaturally camouflage themselves, and their magic renders them difficult to locate."},
  {"name": "Duergar", "url": "https://dnd5e.wikidot.com/lineage:duergar", "description": "Duergar are dwarves whose ancestors were transformed by centuries living in the deepest places of the Underdark. They were further altered by mind flayers and other Aberrations, gaining psionic powers passed down to their descendants."},
  {"name": "Eladrin", "url": "https://dnd5e.wikidot.com/lineage:eladrin", "description": "Eladrin are elves of the Feywild, a realm of perilous beauty and boundless magic. Each eladrin resonates with emotions captured in the Feywild in the form of seasons—affinities that affect their mood and appearance."},
  {"name": "Fairy", "url": "https://dnd5e.wikidot.com/lineage:fairy", "description": "The Feywild is home to many fantastic peoples, including fairies. Infused with the magic of the Feywild, most fairies look like Small elves with insectile wings, but each fairy has a special physical characteristic that sets them apart."},
  {"name": "Firbolg", "url": "https://dnd5e.wikidot.com/lineage:firbolg", "description": "Distant cousins of giants, the first firbolgs wandered the primeval forests of the multiverse, and the magic of those forests entwined itself with the firbolgs’ souls. That magic still thrums inside a firbolg, even one who has never lived under the boughs of a great forest."},
  {"name": "Genasi (Air)", "url": "https://dnd5e.wikidot.com/lineage:genasi-air", "description": "Air genasi are descended from djinn, the genies of the Elemental Plane of Air. Embodying many of the airy traits of their otherworldly ancestors, air genasi can draw upon their connection to the winds."},
  {"name": "Genasi (Earth)", "url": "https://dnd5e.wikidot.com/lineage:genasi-earth", "description": "Tracing their ancestry to dao, the genies of the Elemental Plane of Earth, earth genasi inherit dao’s steadfast strength and control over earth. Their skin can be the colors of stone and earth or a human skin tone with glittering sparkles like gem dust."},
  {"name": "Genasi (Fire)", "url": "https://dnd5e.wikidot.com/lineage:genasi-fire", "description": "Descended from efreet, the genies of the Elemental Plane of Fire, fire genasi channel the flamboyant and often destructive nature of flame. Their skin tones range from deep charcoal to shades of red and orange, sometimes with fiery marks or glowing lines, and their hair can resemble threads of fire or sooty smoke."},
  {"name": "Genasi (Water)", "url": "https://dnd5e.wikidot.com/lineage:genasi-water", "description": "Water genasi descend from marids, aquatic genies from the Elemental Plane of Water. Perfectly suited to life underwater, they carry the power of the waves inside themselves, with skin often in shades of blue or green and hair that can resemble seaweed or water itself."},
  {"name": "Githyanki", "url": "https://dnd5e.wikidot.com/lineage:githyanki", "description": "Once enslaved by mind flayers, githyanki are lanky people with yellow, green, or brown skin who honed their psionic powers in the Astral Plane. Now, they are fierce warriors and conquerors, known for their martial prowess and psychic abilities."},
  {"name": "Githzerai", "url": "https://dnd5e.wikidot.com/lineage:githzerai", "description": "Githzerai migrated to the chaotic plane of Limbo after splitting from their githyanki cousins. Slender and speckled in shades of yellow, green, or brown, they are focused philosophers and ascetics, wielding potent psionic powers to shape chaos and protect themselves."},
  {"name": "Goliath", "url": "https://dnd5e.wikidot.com/lineage:goliath", "description": "The first goliaths lived on the highest mountain peaks, far above the tree line. Distantly related to giants, goliaths are between 7 and 8 feet tall, with skin tones resembling stone, and are known for their strength, endurance, and competitive spirit."},
  {"name": "Harengon", "url": "https://dnd5e.wikidot.com/lineage:harengon", "description": "Harengons are bipedal rabbitfolk from the Feywild, embodying the spirit of freedom and travel. With keen senses, powerful legs, and a bit of fey luck, they are energetic and often find themselves a few fortunate feet away from danger."},
  {"name": "Kenku", "url": "https://dnd5e.wikidot.com/lineage:kenku", "description": "Kenku are feathered folk who resemble ravens, blessed with keen observation and supernaturally accurate memories. Flightless and often found in the Shadowfell or Material Plane, they are skilled mimics and duplicators, but their true origin is shrouded in mystery."},
  {"name": "Locathah", "url": "https://dnd5e.wikidot.com/lineage:locathah", "description": "Locathah are resilient and proud fish-folk who have endured war, slavery, and mistreatment. They dwell in submerged tribal communities along seacoasts and are skilled hunters both above and below the water."},
  {"name": "Owlin", "url": "https://dnd5e.wikidot.com/lineage:owlin", "description": "Distant kin of giant owls from the Feywild, owlin come in many shapes and sizes, from petite and fluffy to wide-winged and majestic. They have arms, legs, and wings, and their feathers make no sound, allowing them to move and fly silently."},
  {"name": "Satyr", "url": "https://dnd5e.wikidot.com/lineage:satyr", "description": "Originating in the Feywild, satyrs thrive on the energy of merriment. They resemble elves with goatlike legs, cloven hooves, and horns, and are known for their innate ability to perform, delight, and resist magical intrusion."},
  {"name": "Sea Elf", "url": "https://dnd5e.wikidot.com/lineage:sea-elf", "description": "Sea elves fell in love with the wild beauty of the ocean in the earliest days of the multiverse. While other elves traveled from realm to realm, sea elves navigated the currents and explored the waters of many worlds, now living wherever oceans exist and in the Elemental Plane of Water."},
  {"name": "Shadar-Kai", "url": "https://dnd5e.wikidot.com/lineage:shadar-kai", "description": "Shadar-kai are elves of the Shadowfell, originally drawn to that realm by the Raven Queen. Once fey, they now exist in a state between life and death, with ashen skin and a somber nature, venturing into the Material Plane to serve the Raven Queen or forge their own destinies."},
  {"name": "Tabaxi", "url": "https://dnd5e.wikidot.com/lineage:tabaxi", "description": "Created by the Cat Lord to blend the qualities of humanoids and cats, tabaxi are a varied people in both attitude and appearance. Driven by curiosity, they are natural travelers and collectors of stories, with feline agility and keen senses."},
  {"name": "Tortle", "url": "https://dnd5e.wikidot.com/lineage:tortle", "description": "Tortles are turtle folk who live on many worlds, journeying along coasts and waterways. They wear their homes on their backs, feel mystically connected to nature, and are known for their sense of security and survival instincts."},
  {"name": "Triton", "url": "https://dnd5e.wikidot.com/lineage:triton", "description": "Originally from the Elemental Plane of Water, tritons entered the Material Plane to protect the world from threats in the deep. With webbed hands and feet, fins, and blue-green coloration, they are noble guardians of the ocean depths and surface alike."},
  {"name": "Verdan", "url": "https://dnd5e.wikidot.com/lineage:verdan", "description": "Verdan owe their existence to chaos, descended from goblins and hobgoblins and transformed by the shadow of That-Which-Endures. They are the newest race of Faerûn, known for their adaptability, telepathy, and persuasive nature."},
  {"name": "Bugbear", "url": "https://dnd5e.wikidot.com/lineage:bugbear", "description": "Bugbears are hulking cousins of goblins and hobgoblins, with roots in the Feywild. Long of limb and covered in coarse hair, they are formidable yet quiet skulkers, gifted with fey magic that allows them to hide in spaces seemingly too small for them."},
  {"name": "Centaur", "url": "https://dnd5e.wikidot.com/lineage:centaur", "description": "Centaurs gallop throughout the multiverse, tracing their origins to many realms. With the upper body of an elf or human and the lower body of a horse, they are powerful, curious, and quick to act, resonating with the natural world and the magic of the Feywild."},
  {"name": "Goblin", "url": "https://dnd5e.wikidot.com/lineage:goblin", "description": "Goblins are a subterranean folk found throughout the multiverse, often alongside bugbear and hobgoblin kin. Once blessed by the Feywild, they are cunning, nimble, and possess a supernatural knack for finding weak spots in larger foes and escaping trouble."},
  {"name": "Grung", "url": "https://dnd5e.wikidot.com/lineage:grung", "description": "Grungs are aggressive, froglike humanoids found in rain forests and tropical jungles. Fiercely territorial and organized by a strict caste system, they secrete a substance that is harmless to them but poisonous to others, and are always on the lookout for creatures to capture and enslave."},
  {"name": "Hobgoblin", "url": "https://dnd5e.wikidot.com/lineage:hobgoblin", "description": "Hobgoblins trace their origins to the Feywild, where they first appeared with goblins and bugbears. Driven from the Feywild by Maglubiyet, they are known for their unity, martial prowess, and mystical bonds of reciprocity that create deep community ties."},
  {"name": "Kobold", "url": "https://dnd5e.wikidot.com/lineage:kobold", "description": "Kobolds are small draconic creatures with rust-colored scales, descended from the earliest dragons. Clever, social, and fiercely devoted to their tribe, kobolds display their draconic ancestry in their appearance and in the power of their cries."},
  {"name": "Lizardfolk", "url": "https://dnd5e.wikidot.com/lineage:lizardfolk", "description": "Lizardfolk are saurian people thought to be distant cousins of dragonborn and kobolds, but are their own people with a mystical connection to the natural world. Gifted with remarkable physical defenses, they survive with their wits in situations deadly to others."},
  {"name": "Minotaur", "url": "https://dnd5e.wikidot.com/lineage:minotaur", "description": "Minotaurs are barrel-chested humanoids with heads resembling those of bulls, blessed with a supernaturally strong sense of direction. They are known for their strength, courage, and keen tactics, making them excellent navigators and formidable warriors."},
  {"name": "Orc", "url": "https://dnd5e.wikidot.com/lineage:orc", "description": "Orcs trace their creation to the god Gruumsh, who granted them toughness and tenacity. Found above and below ground, orcs are tireless guardians and mighty allies, known for their strength, endurance, and powerful devotion to their gods and causes."},
  {"name": "Shifter", "url": "https://dnd5e.wikidot.com/lineage:shifter", "description": "Shifters, sometimes called weretouched, are descendants of people who contracted lycanthropy. Humanoids with a bestial aspect, shifters can temporarily enhance their animalistic features by entering a state called shifting, gaining unique abilities."},
  {"name": "Yuan-Ti", "url": "https://dnd5e.wikidot.com/lineage:yuan-ti", "description": "Yuan-ti were originally humans who transformed themselves into serpent folk through ancient rituals. Most became monsters, but some became a new people who mix human and snake traits, blessed with resistance to magic and poison."},
  {"name": "Kender", "url": "https://dnd5e.wikidot.com/lineage:kender", "description": "Kender originated on Krynn, transformed from gnomes by wild magic. Diminutive and curious, kender are driven to adventure by supernatural curiosity and fearlessness, often amassing collections of curiosities and finding themselves in unexpected places."},
  {"name": "Warforged", "url": "https://dnd5e.wikidot.com/lineage:warforged", "description": "Warforged were built to fight in the Last War, blending organic and inorganic materials. Sentient and capable of emotion, they seek purpose beyond war, and are known for their resilience, integrated protection, and unique construction."},
  {"name": "Aetherborn", "url": "https://dnd5e.wikidot.com/lineage:aetherborn", "description": "Aetherborn come into being spontaneously as part of the aether refinement process. Lacking biological qualities and gender, each aetherborn is a unique individual, living short but intense lives driven by hedonism and self-interest."},
  {"name": "Aven", "url": "https://dnd5e.wikidot.com/lineage:aven", "description": "Aven have humanlike bodies with birdlike wings and heads, coming in hawk-headed and ibis-headed varieties. They delight in flying above their foes, using superior mobility and keen senses to outpace opponents and explore the skies."},
  {"name": "Khenra", "url": "https://dnd5e.wikidot.com/lineage:khenra", "description": "Khenra of Amonkhet are tall, lean, jackal-headed humanoids, almost always born as twins. They are known for their close emotional bonds, agility, and aggressive nature, especially when a twin is lost."},
  {"name": "Kor", "url": "https://dnd5e.wikidot.com/lineage:kor", "description": "Kor are tall, slender nomads deeply reverent of the land, living a spare existence defined by constant travel. Masters of ropes and climbing, they scale cliffs and cross chasms with agility, and communicate with a unique sign language."},
  {"name": "Merfolk", "url": "https://dnd5e.wikidot.com/lineage:merfolk", "description": "Merfolk are an amphibious race, born and at home in the water but comfortable on dry land. Humanoid in form, they have colorful skin, webbed fingers and toes, and long fins, and are known for their curiosity, knowledge, and adaptability."},
  {"name": "Naga", "url": "https://dnd5e.wikidot.com/lineage:naga", "description": "Naga resemble enormous snakes with humanoid torsos, arms, and heads. Adorned with armor and jewelry, they are known for their speed, natural weapons, and immunity to poison, and are often associated with ancient wisdom and power."},
  {"name": "Siren", "url": "https://dnd5e.wikidot.com/lineage:siren", "description": "Sirens are humanoid creatures with birdlike features, long arms that extend into wings, and sharp claws. Mercurial and curious, they are at home along coasts and islands, and are known for their alluring songs and fascination with ships."},
  {"name": "Vampire", "url": "https://dnd5e.wikidot.com/lineage:vampire", "description": "Vampires are associated with necromancy, draining the life from others to fuel their own existence. They believe the strong should take what they need from the weak, and are known for their strict hierarchies and resistance to necrotic damage."},
  {"name": "Dhampir", "url": "https://dnd5e.wikidot.com/lineage:dhampir", "description": "Poised between the worlds of the living and the dead, dhampirs retain their grip on life but are endlessly tested by vicious hungers. Their undead ties grant them speed, darkvision, and a life-draining bite, making them skilled hunters and survivors."},
  {"name": "Hexblood", "url": "https://dnd5e.wikidot.com/lineage:hexblood", "description": "Hexbloods are individuals infused with eldritch magic, fey energy, or witchcraft, often as a result of a bargain with a hag. Marked by unusual features and magical abilities, they seek to discover the mysteries of their magic and fey nature."},
  {"name": "Reborn", "url": "https://dnd5e.wikidot.com/lineage:reborn", "description": "Reborn are individuals who have died yet, somehow, still live. Some exhibit the scars of fatal ends, while others are marvels of magic or science, stitched together or bearing mysterious minds in manufactured bodies. Whatever their origins, reborn know a new life and seek experiences and answers all their own."},
  {"name": "Loxodon", "url": "https://dnd5e.wikidot.com/lineage:loxodon", "description": "Loxodons are often oases of calm, moving slowly or sitting in perfect stillness. These elephantine folk are known for their wisdom, strength, and powerful build, as well as their serene and gentle nature."},
  {"name": "Simic Hybrid", "url": "https://dnd5e.wikidot.com/lineage:simic-hybrid", "description": "Simic hybrids are the result of magical experiments by the Simic Combine, fusing animal traits into humanoids to create superior soldiers. These hyper-evolved beings are adapted to a variety of combat situations and sometimes call themselves guardians."},
  {"name": "Vedalken", "url": "https://dnd5e.wikidot.com/lineage:vedalken", "description": "Vedalken are tall, slender, blue-skinned folk who are partially amphibious and known for their intelligence, precision, and dispassionate logic. They are meticulous, curious, and value knowledge and improvement above all else."},
  {"name": "Astral Elf", "url": "https://dnd5e.wikidot.com/lineage:astral-elf", "description": "Astral Elves are elves who have adapted to life in the Astral Plane, drawing on its magic and timelessness. (No official summary available on Wikidot; see Spelljammer: Adventures in Space for details.)"},
  {"name": "Autognome", "url": "https://dnd5e.wikidot.com/lineage:autognome", "description": "Autognomes are mechanical beings built by rock gnomes, sometimes separated from their creators by malfunction or circumstance. Each autognome is unique, with a variety of internal components, and they often set out to find their own purpose."},
  {"name": "Giff", "url": "https://dnd5e.wikidot.com/lineage:giff", "description": "Giff are tall, broad-shouldered folk with hippo-like features, known for their impressive size and unforgettable appearance. They are connected to the Astral Plane and possess a spark of divine power, often channeling it through their weapons."},
  {"name": "Hadozee", "url": "https://dnd5e.wikidot.com/lineage:hadozee", "description": "Hadozees are sapient, bipedal mammals with wing-like flaps that enable them to glide. Natural climbers with dexterous feet, they are eager to explore new worlds beyond their home trees."},
  {"name": "Plasmoid", "url": "https://dnd5e.wikidot.com/lineage:plasmoid", "description": "Plasmoids are amorphous beings with no typical shape, able to alter their form and color. They consume food by osmosis, breathe through pores, and can stiffen their bodies to maintain a humanoid shape."},
  {"name": "Thri-kreen", "url": "https://dnd5e.wikidot.com/lineage:thri-kreen", "description": "Thri-kreen are insectile folk with two pairs of arms and protective chitin. They can alter their carapace coloration to blend in, communicate via telepathy, and do not require sleep, remaining aware during periods of rest."},
  {"name": "Leonin", "url": "https://dnd5e.wikidot.com/lineage:leonin", "description": "Leonin are lion-like humanoids who guard the golden plains of Oreskos. Proud and strong, they rarely interact with outsiders, but some seek to test themselves in the wider world beyond their homeland."},
  {"name": "Viashino", "url": "https://dnd5e.wikidot.com/lineage:viashino", "description": "Viashino are lizardfolk native to the worlds of Magic: The Gathering, known for their agility, resilience, and tribal societies. (No official summary available on Wikidot; see Guildmaster's Guide to Ravnica or Magic: The Gathering sources for details.)"}
]
